RTEMS/rtems/bsps/arm/imxrt/mcux-sdk/drivers/snvs_lp/fsl_snvs_lp.c
#if defined(FSL_FEATURE_SNVS_HAS_ACTIVE_TAMPERS) && (FSL_FEATURE_SNVS_HAS_ACTIVE_TAMPERS > 0)
/*!
 * brief Enable active tamper tx external pad
 *
 * param base SNVS peripheral base address
 * param pin SNVS external tamper pin
 */
status_t SNVS_LP_EnableTxActiveTamper(SNVS_Type *base, snvs_lp_active_tx_tamper_t pin, tamper_active_tx_config_t config)
{
    status_t status = kStatus_Success;

    switch (pin)
    {
        case (kSNVS_ActiveTamper1):
        {
            /* Enable active tamper tx external pad */
            base->LPATCTLR |= SNVS_LPATCTLR_AT1_PAD_EN_MASK;
            /* Set seed and polynomial */
            base->LPATCR[0] |= SNVS_LPATCR_Seed(config.seed) | SNVS_LPATCR_Polynomial(config.polynomial);
            /* Set clock */
            base->LPATCLKR |= SNVS_LPATCLKR_AT1_CLK_CTL(config.clock);
            /* Enable active tamper pin */
            base->LPATCTLR |= SNVS_LPATCTLR_AT1_EN_MASK;
            break;
        }
        case (kSNVS_ActiveTamper2):
        {
            base->LPATCTLR |= SNVS_LPATCTLR_AT2_PAD_EN_MASK;
            base->LPATCR[1] |= SNVS_LPATCR_Seed(config.seed) | SNVS_LPATCR_Polynomial(config.polynomial);
            base->LPATCLKR |= SNVS_LPATCLKR_AT2_CLK_CTL(config.clock);
            base->LPATCTLR |= SNVS_LPATCTLR_AT2_EN_MASK;
            break;
        }
        case (kSNVS_ActiveTamper3):
        {
            base->LPATCTLR |= SNVS_LPATCTLR_AT3_PAD_EN_MASK;
            base->LPATCR[2] |= SNVS_LPATCR_Seed(config.seed) | SNVS_LPATCR_Polynomial(config.polynomial);
            base->LPATCLKR |= SNVS_LPATCLKR_AT3_CLK_CTL(config.clock);
            base->LPATCTLR |= SNVS_LPATCTLR_AT3_EN_MASK;
            break;
        }
        case (kSNVS_ActiveTamper4):
        {
            base->LPATCTLR |= SNVS_LPATCTLR_AT4_PAD_EN_MASK;
            base->LPATCR[3] |= SNVS_LPATCR_Seed(config.seed) | SNVS_LPATCR_Polynomial(config.polynomial);
            base->LPATCLKR |= SNVS_LPATCLKR_AT4_CLK_CTL(config.clock);
            base->LPATCTLR |= SNVS_LPATCTLR_AT4_EN_MASK;
            break;
        }
        case (kSNVS_ActiveTamper5):
        {
            base->LPATCTLR |= SNVS_LPATCTLR_AT5_PAD_EN_MASK;
            base->LPATCR[4] |= SNVS_LPATCR_Seed(config.seed) | SNVS_LPATCR_Polynomial(config.polynomial);
            base->LPATCLKR |= SNVS_LPATCLKR_AT5_CLK_CTL(config.clock);
            base->LPATCTLR |= SNVS_LPATCTLR_AT5_EN_MASK;
            break;
        }
        default:
            status = kStatus_InvalidArgument;
            /* All the cases have been listed above, the default clause should not be reached. */
            break;
    }
    return status;
}

/*!
 * brief Enable active tamper rx external pad
 *
 * param base SNVS peripheral base address
 * param rx SNVS external RX tamper pin
 * param config SNVS RX tamper config structure
 */
status_t SNVS_LP_EnableRxActiveTamper(SNVS_Type *base, snvs_lp_external_tamper_t rx, tamper_active_rx_config_t config)
{
    status_t status = kStatus_Success;

    switch (rx)
    {
        case (kSNVS_ExternalTamper1):
            /* Enable filter and set it's value, dissable otherwise */
            if (config.filterenable != 0U)
            {
                SNVS->LPTGFCR |= SNVS_LPTGFCR_ETGF1_EN_MASK;
                SNVS->LPTGFCR |= SNVS_LPTGFCR_ETGF1(config.filter);
            }
            else
            {
                SNVS->LPTGFCR &= ~SNVS_LPTGFCR_ETGF1_EN_MASK;
            }

            /* Route TX to external tamper 1 */
            base->LPATRC1R = SNVS_LPATRC1R_ET1RCTL(config.activeTamper);

            /* enable tamper pin */
            base->LPTDCR |= SNVS_LPTDCR_ET1_EN_MASK;
            break;
#if defined(FSL_FEATURE_SNVS_HAS_MULTIPLE_TAMPER) && (FSL_FEATURE_SNVS_HAS_MULTIPLE_TAMPER > 1)
        case (kSNVS_ExternalTamper2):
            /* Enable filter and set it's value, dissable otherwise */
            if (config.filterenable != 0U)
            {
                SNVS->LPTGFCR |= SNVS_LPTGFCR_ETGF2_EN_MASK;
                SNVS->LPTGFCR |= SNVS_LPTGFCR_ETGF2(config.filter);
            }
            else
            {
                SNVS->LPTGFCR &= ~SNVS_LPTGFCR_ETGF2_EN_MASK;
            }

            /* Route TX to external tamper 2 */
            base->LPATRC1R = SNVS_LPATRC1R_ET2RCTL(config.activeTamper);

            /* enable tamper pin */
            SNVS->LPTDCR |= SNVS_LPTDCR_ET2_EN_MASK;

            break;
        case (kSNVS_ExternalTamper3):
            /* Enable filter and set it's value if set */
            if (config.filterenable != 0U)
            {
                /* Set filter value */
                SNVS->LPTGF1CR |= SNVS_LPTGF1CR_ETGF3(config.filter);
                /* Enable tamper 3 glitch filter */
                SNVS->LPTGF1CR |= SNVS_LPTGF1CR_ETGF3_EN(1U);
            }

            /* Route TX to external tamper 3 */
            base->LPATRC1R = SNVS_LPATRC1R_ET3RCTL(config.activeTamper);

            /* enable tamper pin */
            base->LPTDC2R |= SNVS_LPTDC2R_ET3_EN_MASK;
            break;
        case (kSNVS_ExternalTamper4):
            /* Enable filter and set it's value if set */
            if (config.filterenable != 0U)
            {
                /* Set filter value */
                SNVS->LPTGF1CR |= SNVS_LPTGF1CR_ETGF4(config.filter);
                /* Enable tamper 4 glitch filter */
                SNVS->LPTGF1CR |= SNVS_LPTGF1CR_ETGF4_EN(1U);
            }

            /* Route TX to external tamper 4 */
            base->LPATRC1R = SNVS_LPATRC1R_ET4RCTL(config.activeTamper);

            /* enable tamper pin */
            base->LPTDC2R |= SNVS_LPTDC2R_ET4_EN_MASK;
            break;
        case (kSNVS_ExternalTamper5):
            /* Enable filter and set it's value if set */
            if (config.filterenable != 0U)
            {
                /* Set filter value */
                SNVS->LPTGF1CR |= SNVS_LPTGF1CR_ETGF5(config.filter);
                /* Enable tamper 5 glitch filter */
                SNVS->LPTGF1CR |= SNVS_LPTGF1CR_ETGF5_EN(1U);
            }

